In [1]:
import numpy as np

In [3]:
import pandas as pd

In [4]:
#operations

In [27]:
df = pd.read_csv('df11.csv')
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [26]:
#data selections

In [18]:
df['A']>2

0    False
1    False
2    False
Name: A, dtype: bool

In [19]:
df[df['A']>2]

Empty DataFrame
Columns: [A, B, C]
Index: []

In [20]:
df[(df['A']>2) & (df['B']==444)]

Empty DataFrame
Columns: [A, B, C]
Index: []

# costum function

In [22]:
def tinmes2(x):
    return x*2
df['A'].apply(tinmes2)

0    2.0
1    4.0
2    NaN
Name: A, dtype: float64

In [24]:
df.apply(tinmes2)

     A     B  C
0  2.0  10.0  2
1  4.0   NaN  4
2  NaN   NaN  6

In [29]:
# permanently remove a colum

In [30]:
del df['A']

In [33]:
df

     B  C
0  5.0  1
1  NaN  2
2  NaN  3

In [32]:
# sorting and ordering

In [35]:
# group by